In [1]:
import pandas as pd

In [2]:
scientists = pd.read_csv('data/pandas/scientists.csv')
ages = scientists['Age']

In [3]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [4]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [6]:
# 브로드캐스팅 : 같은 shape, size가 아니더라도 계산이 가능하게 해주는 기술
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [10]:
s = pd.Series([1, 100], index=[1, 2])
s

1      1
2    100
dtype: int64

In [12]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [ ]:
# Null, None : 비슷한 개념
# Nan : Not A Number - 계산이 정상적이지 아닐때 나오는 값

# 판다스에서는 Null == Nan == None

In [13]:
None + 1

TypeError: unsupported operand type(s) for +: 'NoneType' and 'int'

In [16]:
ages + s

0      NaN
1     62.0
2    190.0
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [18]:
s = pd.Series([1, 100], index=[99, 100])
s

99       1
100    100
dtype: int64

In [20]:
ages + s

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
99    NaN
100   NaN
dtype: float64

In [21]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [23]:
rev_ages = ages.sort_index(ascending=False)
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [24]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [25]:
ages + rev_ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [29]:
ages[ages >= 50]

1    61
2    90
3    66
4    56
7    77
Name: Age, dtype: int64

In [32]:
scientists[scientists == 37]

  Name Born Died   Age Occupation
0  NaN  NaN  NaN  37.0        NaN
1  NaN  NaN  NaN   NaN        NaN
2  NaN  NaN  NaN   NaN        NaN
3  NaN  NaN  NaN   NaN        NaN
4  NaN  NaN  NaN   NaN        NaN
5  NaN  NaN  NaN   NaN        NaN
6  NaN  NaN  NaN   NaN        NaN
7  NaN  NaN  NaN   NaN        NaN

In [49]:
rev_bool = (ages == 37).sort_index(ascending=False)

In [ ]:
scientists.loc[ row  ,  col ]

In [47]:
scientists['Name']

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [53]:
rev_bool

7    False
6    False
5    False
4    False
3    False
2    False
1    False
0     True
Name: Age, dtype: bool

In [50]:
scientists[rev_bool]

C:\Users\admin\AppData\Local\Temp\ipykernel_6916\270977888.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  scientists[rev_bool]

                Name        Born        Died  Age Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist

In [44]:
scientists.loc[ages == 37]

0    37
Name: Age, dtype: int64

In [40]:
scientists[[True,False,False,False,False,False,False,False]]

                Name        Born        Died  Age Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist

In [36]:
import numpy as np

arr = np.array([1,2,3,4,5])
arr >= 3

array([False, False,  True,  True,  True])

In [38]:
arr[arr >= 3]  # == arr[[False, False,  True,  True,  True]]

array([3, 4, 5])

In [55]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [58]:
arr.astype(np.int8)

array([1, 2, 3, 4, 5], dtype=int8)

In [66]:
ages_str = ages.astype(str)
ages_str

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: object

In [67]:
ages_str[0]

'37'

In [70]:
str(ages[0])

'37'

In [72]:
scientists.iloc[0]['Age']

37

In [73]:
ages + ages_str

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [75]:
scientists['Born']

0    1920-07-25
1    1876-06-13
2    1820-05-12
3    1867-11-07
4    1907-05-27
5    1813-03-15
6    1912-06-23
7    1777-04-30
Name: Born, dtype: object

In [81]:
pd.to_datetime('01/10/2024', format='%d/%m/%Y')

Timestamp('2024-10-01 00:00:00')

In [85]:
pd.to_datetime(scientists['Born'], format='%Y-%m-%d')

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [84]:
scientists['Born'].astype('datetime64[ns]')

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [88]:
pd.to_datetime('2024년 1월', format='%Y년 %m월')

Timestamp('2024-01-01 00:00:00')

In [110]:
pd.to_datetime(scientists['Born'], format='%Y-%m-%d')

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [89]:
scientists['born_dt'] = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
scientists['died_dt'] = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')

In [91]:
scientists.dtypes

Name                  object
Born                  object
Died                  object
Age                    int64
Occupation            object
born_dt       datetime64[ns]
died_dt       datetime64[ns]
dtype: object

In [92]:
scientists['Born'] = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')

In [94]:
scientists.dtypes

Name                  object
Born          datetime64[ns]
Died                  object
Age                    int64
Occupation            object
born_dt       datetime64[ns]
died_dt       datetime64[ns]
dtype: object

In [96]:
ages[2] = 80

C:\Users\admin\AppData\Local\Temp\ipykernel_6916\136903657.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ages[2] = 80

In [97]:
ages

0    37
1    61
2    80
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [98]:
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,80,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [101]:
s[99] = 20
s

99      20
100    100
dtype: int64

In [102]:
s[101] = 120
s

99      20
100    100
101    120
dtype: int64

In [108]:
scientists.loc[2, 'Age'] = 90

In [109]:
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [112]:
s

99      20
100    100
101    120
dtype: int64

In [120]:
df = pd.DataFrame([[10], [20], [30]], index=[99, 100, 101])
df['s'] = s
df

      0    s
99   10   20
100  20  100
101  30  120

In [149]:
pd.to_datetime('1월 24일 12시 37분', format = '%m월 %d일 %H시 %M분')

Timestamp('1900-01-24 12:37:00')

In [150]:
scientists['died_dt'] - scientists['born_dt']

0   13779 days
1   22404 days
2   32964 days
3   24345 days
4   20777 days
5   16529 days
6   15324 days
7   28422 days
dtype: timedelta64[ns]

In [153]:
print(scientists['born_dt'].dt.year)

0    1920
1    1876
2    1820
3    1867
4    1907
5    1813
6    1912
7    1777
Name: born_dt, dtype: int32

In [154]:
print(scientists['born_dt'].dt.month)

0     7
1     6
2     5
3    11
4     5
5     3
6     6
7     4
Name: born_dt, dtype: int32

In [155]:
print(scientists['born_dt'].dt.day)

0    25
1    13
2    12
3     7
4    27
5    15
6    23
7    30
Name: born_dt, dtype: int32

In [156]:
print(scientists['born_dt'].dt.quarter)

0    3
1    2
2    2
3    4
4    2
5    1
6    2
7    2
Name: born_dt, dtype: int32

In [175]:
# 요일 데이터
scientists['born_dt'].dt.weekday  # year, month, day, quarter, hour, minute, second

0    6
1    1
2    4
3    3
4    0
5    0
6    6
7    2
Name: born_dt, dtype: int32

In [177]:
scientists['born_dt'].dt.strftime('%a')

0    Sun
1    Tue
2    Fri
3    Thu
4    Mon
5    Mon
6    Sun
7    Wed
Name: born_dt, dtype: object

In [178]:
scientists.loc[[1, 3, 5, 7], 'Age'] = 'missing'
print(scientists['Age'].dtype)
scientists

object

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,missing,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,missing,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,missing,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,missing,Mathematician,1777-04-30,1855-02-23

In [189]:
pd.to_numeric(scientists['Age'], errors='coerce')

0    37.0
1     NaN
2    90.0
3     NaN
4    56.0
5     NaN
6    41.0
7     NaN
Name: Age, dtype: float64

In [187]:
scientists.drop('Age', axis=1)

,Name,Born,Died,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23

In [188]:
scientists.drop(0, axis=0)

,Name,Born,Died,Age,Occupation,born_dt,died_dt
1,William Gosset,1876-06-13,1937-10-16,missing,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,missing,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,missing,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,missing,Mathematician,1777-04-30,1855-02-23

In [190]:
scientists.drop(['born_dt', 'died_dt'], axis=1)

                   Name       Born        Died      Age          Occupation
0     Rosaline Franklin 1920-07-25  1958-04-16       37             Chemist
1        William Gosset 1876-06-13  1937-10-16  missing        Statistician
2  Florence Nightingale 1820-05-12  1910-08-13       90               Nurse
3           Marie Curie 1867-11-07  1934-07-04  missing             Chemist
4         Rachel Carson 1907-05-27  1964-04-14       56           Biologist
5             John Snow 1813-03-15  1858-06-16  missing           Physician
6           Alan Turing 1912-06-23  1954-06-07       41  Computer Scientist
7          Johann Gauss 1777-04-30  1855-02-23  missing       Mathematician

In [191]:
scientists.drop([0,1,2,3], axis=0)

,Name,Born,Died,Age,Occupation,born_dt,died_dt
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,missing,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,missing,Mathematician,1777-04-30,1855-02-23

In [215]:
df

      0    s
100  20  100
101  30  120

In [216]:
df.drop(99, inplace=True)

KeyError: '[99] not found in axis'

In [217]:
names = scientists['Name']
names.to_pickle('pandas/scientists_names_series.pickle')

In [218]:
scientists.to_pickle('pandas/scientists.pickle')

In [220]:
pd.read_pickle('pandas/scientists_names_series.pickle')

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [268]:
pd.read_pickle('pandas/scientists.pickle')

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,missing,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,missing,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,missing,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,missing,Mathematician,1777-04-30,1855-02-23

In [222]:
import pickle

In [225]:
with open('pandas/test.pickle', 'wb') as f:
    pickle.dump([1,2,3], f)

In [228]:
with open('pandas/test.pickle', 'rb') as f:
    a = pickle.load(f)
    print(a)

[1, 2, 3]

In [229]:
scientists.to_csv('pandas/scientists_df.csv')

In [241]:
scientists.to_csv('pandas/scientists_notindex.csv', index = False)

In [270]:
pd.read_csv('pandas/scientists_df.csv', index_col = 0)

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,missing,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,missing,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,missing,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,missing,Mathematician,1777-04-30,1855-02-23

In [250]:
# header = 컬럼명을 row에서 지정해서 들고오겠다.
pd.read_csv('pandas/scientists_notindex.csv', header = 3)

,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12.1,1910-08-13.1
0,Marie Curie,1867-11-07,1934-07-04,missing,Chemist,1867-11-07,1934-07-04
1,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
2,John Snow,1813-03-15,1858-06-16,missing,Physician,1813-03-15,1858-06-16
3,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
4,Johann Gauss,1777-04-30,1855-02-23,missing,Mathematician,1777-04-30,1855-02-23

In [275]:
# skiprows = row를 위에서부터 N줄 무시하겠다
pd.read_csv('data/numpy/ex2_전년대비_시도별_교통사망사고.csv', encoding='euc-kr', 
            skiprows=3, header = None).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       17 non-null     int64
 1   1       17 non-null     int64
 2   2       17 non-null     int64
 3   3       17 non-null     float64
 4   4       17 non-null     int64
 5   5       17 non-null     float64
dtypes: float64(2), int64(4)
memory usage: 948.0 bytes

In [262]:
# usecols : 컬럼을 원하는것만 선택해서 들고올때 사용(컬럼인덱스 또는 컬럼명)
pd.read_csv('pandas/scientists_notindex.csv',usecols = ['Name', 'Occupation'])

                   Name          Occupation
0     Rosaline Franklin             Chemist
1        William Gosset        Statistician
2  Florence Nightingale               Nurse
3           Marie Curie             Chemist
4         Rachel Carson           Biologist
5             John Snow           Physician
6           Alan Turing  Computer Scientist
7          Johann Gauss       Mathematician

In [266]:
# encoding : 'euc-kr'  or  'cp949' 
pd.read_csv('data/numpy/ex1_지역별전기요금.csv', encoding='cp949')

,,,,,# 지역구분,대상 가구수(호),가구당 평균 전력사용량(kWh),가구당 평균 전기요금(원)
# 강원1,경기2,경남3,경북4,광주5,대구6,대전7,부산8,서울9
# 세종10,울산11,인천12,전남13,전북14,제주15,충남16,충북17,NaN
1,565082,273,27177,NaN,NaN,NaN,NaN,NaN
2,2827233,444,45111,NaN,NaN,NaN,NaN,NaN
3,1144913,289,29043,NaN,NaN,NaN,NaN,NaN
4,1131034,230,22436,NaN,NaN,NaN,NaN,NaN
5,380425,391,38020,NaN,NaN,NaN,NaN,NaN
6,668623,364,35245,NaN,NaN,NaN,NaN,NaN
7,425659,344,32331,NaN,NaN,NaN,NaN,NaN
8,947300,366,36274,NaN,NaN,NaN,NaN,NaN
9,2737725,361,36569,NaN,NaN,NaN,NaN,NaN
10,49394,580,57091,NaN,NaN,NaN,NaN,NaN
11,323151,353,35470,NaN,NaN,NaN,NaN,NaN
12,734723,398,40049,NaN,NaN,NaN,NaN,NaN
13,726699,249,25120,NaN,NaN,NaN,NaN,NaN
14,634696,285,28556,NaN,NaN,NaN,NaN,NaN
15,258605,221,22180,NaN,NaN,NaN,NaN,NaN
16,742285,282,27901,NaN,NaN,NaN,NaN,NaN
17,584500,268,26899,NaN,NaN,NaN,NaN,NaN

In [273]:
# parse_dates : 날짜 형태의 문자열 >> 날짜타입(datetime)으로 바꿔줌 (컬럼인덱스 또는 컬럼명)
pd.read_csv('pandas/scientists_notindex.csv',parse_dates = [1, 2]).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      datetime64[ns]
 2   Died        8 non-null      datetime64[ns]
 3   Age         8 non-null      object
 4   Occupation  8 non-null      object
 5   born_dt     8 non-null      object
 6   died_dt     8 non-null      object
dtypes: datetime64[ns](2), object(5)
memory usage: 580.0+ bytes

In [ ]:
# header, index, encoding
scientists.to_csv()

In [276]:
scientists.index

RangeIndex(start=0, stop=8, step=1)

In [277]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt'], dtype='object')

In [278]:
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,missing,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,missing,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,missing,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,missing,Mathematician,1777-04-30,1855-02-23

In [281]:
scientists.index = range(1, 16,2)

In [282]:
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt
1,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
3,William Gosset,1876-06-13,1937-10-16,missing,Statistician,1876-06-13,1937-10-16
5,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
7,Marie Curie,1867-11-07,1934-07-04,missing,Chemist,1867-11-07,1934-07-04
9,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
11,John Snow,1813-03-15,1858-06-16,missing,Physician,1813-03-15,1858-06-16
13,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
15,Johann Gauss,1777-04-30,1855-02-23,missing,Mathematician,1777-04-30,1855-02-23

In [284]:
scientists.columns = ['Name','Born','Died','Age','Occupation','Born_Dt','Died_Dt']

In [285]:
scientists

,Name,Born,Died,Age,Occupation,Born_Dt,Died_Dt
1,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
3,William Gosset,1876-06-13,1937-10-16,missing,Statistician,1876-06-13,1937-10-16
5,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
7,Marie Curie,1867-11-07,1934-07-04,missing,Chemist,1867-11-07,1934-07-04
9,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
11,John Snow,1813-03-15,1858-06-16,missing,Physician,1813-03-15,1858-06-16
13,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
15,Johann Gauss,1777-04-30,1855-02-23,missing,Mathematician,1777-04-30,1855-02-23

In [287]:
a = scientists.set_index('Name')

In [293]:
a

,Born,Died,Age,Occupation,Born_Dt,Died_Dt
Name,,,,,,
Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
William Gosset,1876-06-13,1937-10-16,missing,Statistician,1876-06-13,1937-10-16
Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
Marie Curie,1867-11-07,1934-07-04,missing,Chemist,1867-11-07,1934-07-04
Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
John Snow,1813-03-15,1858-06-16,missing,Physician,1813-03-15,1858-06-16
Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
Johann Gauss,1777-04-30,1855-02-23,missing,Mathematician,1777-04-30,1855-02-23

In [298]:
a.reset_index()

,level_0,index,Name,Born,Died,Age,Occupation,Born_Dt,Died_Dt
0,0,0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,1,1,William Gosset,1876-06-13,1937-10-16,missing,Statistician,1876-06-13,1937-10-16
2,2,2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,3,3,Marie Curie,1867-11-07,1934-07-04,missing,Chemist,1867-11-07,1934-07-04
4,4,4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,5,5,John Snow,1813-03-15,1858-06-16,missing,Physician,1813-03-15,1858-06-16
6,6,6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,7,7,Johann Gauss,1777-04-30,1855-02-23,missing,Mathematician,1777-04-30,1855-02-23

In [302]:
import cx_Oracle as oci

dsn = oci.makedsn('localhost', '1521', 'xe')
conn = oci.connect('scott', 'tiger', dsn)

# cx_Oracle 라이브러리를 사용해서 파이썬으로 테이블 가져오기
cursor = conn.cursor()
cursor.execute('''select * from emp''')
data = cursor.fetchall()
#############################################################
# pandas를 사용해서 conn 정보를 이용해서 테이블 가져오기
emp = pd.read_sql('''select * from emp''', conn)
#############################################################

conn.close()

ModuleNotFoundError: No module named 'cx_Oracle'

In [305]:
import pymysql

conn = pymysql.connect(user = 'maria', 
                       password = '1234',
                       host = 'localhost',
                       port = 3306,
                       database = 'python_db')

# pymysql 라이브러리를 사용해서 파이썬으로 테이블 가져오기
cursor = conn.cursor()
cursor.execute('''select * from book_list''')
data = cursor.fetchall()
#############################################################
# pandas를 사용해서 conn 정보를 이용해서 테이블 가져오기
book_list = pd.read_sql('''select * from book_list''', conn)
#############################################################

conn.close()

C:\Users\admin\AppData\Local\Temp\ipykernel_6916\361850818.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  book_list = pd.read_sql('''select * from book_list''', conn)

In [308]:
conn = pymysql.connect(user = 'maria', 
                       password = '1234',
                       host = 'localhost',
                       port = 3306,
                       database = 'python_db')

book_list.to_sql('bl2', conn)

conn.close()

C:\Users\admin\AppData\Local\Temp\ipykernel_6916\1364207743.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  book_list.to_sql('bl2', conn)

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': not all arguments converted during string formatting

In [313]:
import sqlalchemy as sql
# url : 프로토콜://user:password@host:port/database(or service)
# 프로토콜 : 데이터베이스 종류
# 오라클 : oracle://scott:tiger@localhost:1521/xe
# 마리아 : mysql://maria:1234@localhost:3306/python_db
engine = sql.create_engine('mysql://maria:1234@localhost:3306/python_db')

In [317]:
conn = engine.connect()
conn.close()

In [321]:
pd.read_sql('''select * from bl2''', engine)

,index,BCODE,TITLE,AUTHOR,YEAR-OF-PUBLICATION,PUBLISHER,PRICE
0,0,11261731,개발자가 반드시 알아야 할 자바 성능 튜닝 이야기,이상민,2013년 10월,0,25200
1,1,13566048,빅데이터 컴퓨팅 기술,박두순,2014년 06월,5,22000
2,2,16356629,빅데이터 인문학 : 진격의 서막,에레즈 에이든,2015년 01월,0,22500
3,3,16853792,자바스크립트 UI 개발과 Jindo 프레임워크,박재성,2015년 02월,0,0
4,4,17249689,경영 빅데이터 분석,빅데이터전략연구회,2015년 03월,0,25000
...,...,...,...,...,...,...,...
450,450,124574413,대화형 인공지능을 활용한 정부지원 사업계획서 작성법,김상미,2024년 01월,0,20700
451,451,124577570,인공지능만 믿고 공부는 안 해도 될까요?,이여운,2024년 01월,0,14220
452,452,124587194,0에서 시작하는 ChatGPT,김은경,2024년 01월,0,18000
453,453,124590582,글로벌트렌드 2040 인공지능과 미래사회,진하수,2024년 01월,0,22500
454,454,124591211,대한민국 교육에 대해 묻다,이민환,2023년 12월,0,8500

In [318]:
book_list.to_sql('bl2', engine)

455

In [319]:
book_list.shape

(455, 6)

In [320]:
book_list.head()

,BCODE,TITLE,AUTHOR,YEAR-OF-PUBLICATION,PUBLISHER,PRICE
0,11261731,개발자가 반드시 알아야 할 자바 성능 튜닝 이야기,이상민,2013년 10월,0,25200
1,13566048,빅데이터 컴퓨팅 기술,박두순,2014년 06월,5,22000
2,16356629,빅데이터 인문학 : 진격의 서막,에레즈 에이든,2015년 01월,0,22500
3,16853792,자바스크립트 UI 개발과 Jindo 프레임워크,박재성,2015년 02월,0,0
4,17249689,경영 빅데이터 분석,빅데이터전략연구회,2015년 03월,0,25000